{
	"404": {
		"descripton": "The content you are trying to reach at '/{{path}}' is not available.",
		"title": "404 - Content Not Found!"
	},
	"base-url": "C:\\Users\\alperaktas",
	"clippy": {
		"greeting": "Hello, I'm Clippy!"
	},
	"daily-space-palette": "Daily Space Palette is a web project that fetches the Astronomy Picture of the Day using NASA's API, then generates a color palette from that picture.",
	"error": {
		"fallback-element": "Oops! Looks like you broke my website! If you want to help me fix it, you can check the browser console for the error message and kindly send it to me, pretty please :)"
	},
	"introduction": {
		"menu": {
			"resume": "Resume"
		},
		"about-current-job": "Currently, I work at Etstur as a Software Development Assistant and I participate in developing React-based B2B web applications.",
		"about-experience": "Because of my profound interest in software development, I studied software through online content and solved test cases on websites like HackerRank to invest into the career that I desired to have during my studentship.",
		"about-me": "I am an English Language and Literature graduate from Ege University.",
		"about-preferences": "I generally prefer developing apps with TypeScript and React. Additionally, I write tests using Vitest and react-testing-library, and depending on the project, I may use Playwright as well."
	},
	"login-screen": {
		"footer-info": "After you log on, you can add or change accounts.",
		"instructions": "To begin, please enter your password",
		"turn-off": "Turn off computer"
	},
	"vigenere-cipher": {
		"alphabet": "Alphabet",
		"alphabet-disabled-tooltip": "Alphabet is currently restricted to only Latin characters",
		"decrypt": "Decrypt",
		"encrypt": "Encrypt",
		"input": "Input",
		"key": "Key",
		"key-descripton": "Key to use for '{{method}}' method",
		"method": "Method",
		"output": "Output",
		"title": "Vigenère Cipher"
	},
	"resume": {
		"header": {
			"name": "Alper Aktaş",
			"title": "Software Developer",
			"phone": "+90 534 621 81 05",
			"mail": "aktasalper99@gmail.com",
			"linkedIn": "https://www.linkedin.com/in/aktasalper/",
			"portfolio": "https://www.aktasalper.com/",
			"location": "Avcılar, Istanbul"
		},
		"experience": {
			"title": "Experience",
			"list": [
				{
					"company": "Etstur",
					"title": "Software Development Assistant",
					"period": { "start": "July 25, 2022" },
					"description": "I work in the development of the company's React-based B2B web applications. I am currently leading the software development efforts of our company's UI Kit project. The work environment consists of Figma designs by the UI/UX team and a Jira Sprint managed by product owners. Within this agile workflow, I participated in many projects and contributed heavily to Etstur's frontend modernization efforts. I also wrote documentation articles on our Confluence Wiki platform to share information about the projects I participated in. I am also a front-end representative in the in-house team called 'DevOps Heroes' and I regularly attend weekly meetings to keep up to date with DevOps processes.",
					"roles": [
						{
							"project": "UI Kit",
							"description": "I am the leading developer in converting standardized UI Kit designs on Figma from the UI/UX team into React components for use in all modern projects within the company. In addition to the React-based component library, I wrote a CLI tool that facilitates integration into internal projects. I structured the UI Kit project as a monorepo and simplified the development process by linking the CLI and UI Kit libraries by utilizing yarn's 'workspaces' feature.",
							"stack": ["Storybook", "React", "MUI", "ink", "inquirer", "meow"]
						},
						{
							"project": "E-mail Template",
							"description": "I created this project to standardize emails sent to users by Etstur, starting with 'Etspartners,' and integrated it into the current email process. With the CLI script I wrote, email changes are quickly and automatically deployed to Mandrill. Initially developed with 'mjml-react,' I later updated the project to use 'react-email' to reduce maintenance costs and increase usability.",
							"stack": ["Mandrill", "mjml-react", "react-email", "node.js"]
						},
						{
							"project": "Extranet & Intranet",
							"description": "I occasionally participated in the maintenance of older projects that customers actively use as part of the modernization process.",
							"stack": ["JavaScript", "FTL", "JSTL", "JSP", "Java"]
						},
						{
							"project": "Digital Contract",
							"description": "This project was requested by Etstur's contract team to digitize hotel contracts and track contract processes. I took responsibility for the 'Digital Contract' project as the sole front-end developer from the beginning to live deployment. From April 2023, all resort hotels began managing contract details and documents through the Digital Contract. The project was featured as 'Product of the Month' in Etstur's Monthly Technology Bulletin. After the project went live, I supported the handover and maintenance to the new front-end team.",
							"stack": ["TypeScript", "React", "RTK", "Vite", "Vitest", "CASL"]
						},
						{
							"project": "B2B Boilerplate",
							"description": "I created a boilerplate project to quickly set up B2B React projects. After laying the foundation with 'Etspartners,' I compiled the technologies, code standards, and project structure we might need for other B2B projects and made them reusable in the boilerplate.",
							"stack": ["TypeScript", "React", "RTK", "Vite", "CASL"]
						},
						{
							"project": "etspartners.com",
							"description": "The modernized version of Etstur's B2B dashboard application for our partnered hotels. Rewritten using React and Java Spring Boot. I played a role in setting up the front-end skeleton and was involved in all development, maintenance, and repair processes, except for the time spent on the 'Digital Contract' project.",
							"stack": ["TypeScript", "React", "RTK", "Vite", "Vitest", "CASL"]
						}
					]
				},
				{
					"company": "1Pixel Digital Agency",
					"title": "Front-end Developer Intern",
					"period": { "start": "October 2021", "end": "November 2021" },
					"description": "Through agile processes managed by Jira Sprints, I coded functional and responsive sections of pages corresponding to the related graphic designs.",
					"roles": [
						{
							"project": "Shopify",
							"description": "For sellers using Shopify, I created customizable themes and added user-friendly CMS controls. In addition to integrating these controls into themes, I ensured the flow of dynamic store data to page elements using the Liquid templating language.",
							"stack": ["HTML", "CSS", "Liquid"]
						}
					]
				}
			],
			"present": "Present"
		},
		"education": {
			"title": "Education",
			"list": [
				{
					"institution": "Academy Peak",
					"instructor": "Ömer Çıtak",
					"field": "Secure Software Development",
					"period": "16-18 March, 2023"
				},
				{
					"institution": "Ege University",
					"field": "English Language and Literature",
					"period": "2017 - 2022"
				},
				{
					"institution": "Küçükçekmece High School",
					"field": "Foreign Language Class",
					"period": "2013 - 2017"
				}
			]
		},
		"language": {
			"title": "Languages",
			"list": [
				{ "name": "Turkish", "fluency": "Native" },
				{ "name": "English", "fluency": "Aptis C1" }
			]
		},
		"reference": {
			"title": "References",
			"list": [
				{
					"name": "Alper Derya",
					"title": "Software Development Manager",
					"phone": "+90 533 210 80 28",
					"email": "alper.derya@gmail.com",
					"company": "Etstur"
				},
				{
					"name": "Uğur Yılmaz",
					"title": "Front-end Team Lead",
					"phone": "+90 545 551 19 93",
					"email": "ugrr.yilmaz@gmail.com",
					"company": "Etstur"
				}
			]
		}
	}
}
