{
	"header": {
		"name": "Alper Halil",
		"title": "Software Developer",
		"phone": "+90 534 621 81 05",
		"mail": "aktasalper99@gmail.com",
		"linkedIn": "https://www.linkedin.com/in/aktasalper/",
		"portfolio": "https://www.aktasalper.com/",
		"location": "Schongau, Bayern"
	},
	"experience": {
		"title": "Experience",
		"summary": "Frontend developer with 3+ years of experience delivering scalable, maintainable web applications. Strong foundation in TypeScript and React, with expertise in modern UI patterns, component-driven development, and responsive design. Comfortable working across diverse frontend stacks, with deep familiarity in ecosystem tools like Redux Toolkit, MUI, and Storybook.",
		"present": "Present",
		"companies": {
			"ets-2": {
				"company": "Etstur",
				"title": "Software Developer",
				"period": { "start": "May, 2025", "end": "August, 2025" },
				"description": "Lead software development for the UI Kit project and developed a AI Form Agent as a side project.",
				"role": {
					"1": {
						"project": "Form Agent",
						"description": "A side project chosen for the yearly performance review. Developed a simple POC with Gemini."
					},
					"2": {
						"project": "UI Kit",
						"description": "Lead the development of the B2B UI Kit library, providing reusable React components for Extranet, Intranet, and two additional departmental projects."
					}
				}
			},
			"ets": {
				"company": "Etstur",
				"title": "Junior Software Developer",
				"period": { "start": "July 25, 2022", "end": "May, 2025" },
				"description": "Participated in developing the company's first React-based B2B web applications as part of a legacy modernization initiative. Collaborated with UI/UX designers using Figma and managed tasks in a Jira-driven agile workflow, contributing to multiple projects and documenting processes for knowledge sharing.",
				"role": {
					"1": {
						"project": "UI Kit",
						"description": "Conceptualized and built the UI Kit project, converting Figma designs into a React component library. Created a CLI tool to allow for individual component imports into existing projects and structured the project as a monorepo using Yarn workspaces."
					},
					"2": {
						"project": "E-mail Template",
						"description": "Created a standardized email template system integrated with Mandrill, automating deployments via a custom CLI script. Started with 'mjml-react', then switched to 'react-email' to enhance maintainability and usability."
					},
					"3": {
						"project": "Extranet & Intranet",
						"description": "Maintained and updated legacy Extranet and Intranet applications as part of ongoing modernization efforts."
					},
					"4": {
						"project": "Digital Contract",
						"description": "Owned the Digital Contract project as sole front-end developer from inception to deployment, enabling resort hotels to manage contract details and documents. Recognized as 'Product of the Month' in Etstur's Monthly Technology Bulletin and provided post-launch support to the new front-end team."
					},
					"5": {
						"project": "B2B Boilerplate",
						"description": "Developed a reusable B2B React boilerplate, defining technologies, coding standards, and project structure to accelerate new project setups."
					},
					"6": {
						"project": "etspartners.com",
						"description": "Contributed to the modernization of Etstur's B2B dashboard (etspartners.com), rewriting the frontend in React and integrating with a Java Spring Boot backend. Involved in development, maintenance, and troubleshooting activities except during dedicated work on the Digital Contract project."
					}
				}
			},
			"1pixel": {
				"company": "1Pixel Digital Agency",
				"title": "Front-End Development Intern",
				"period": { "start": "October 2021", "end": "November 2021" },
				"description": "Implemented responsive, functional page sections based on graphic designs within a Jira-managed agile process.",
				"role": {
					"1": {
						"project": "Shopify Templates",
						"description": "Developed customizable Shopify themes with CMS controls and integrated dynamic store data using Liquid templating."
					}
				}
			}
		}
	},
	"education": {
		"title": "Education",
		"1": {
			"institution": "Küçükçekmece High School",
			"field": "Foreign Language Class",
			"period": "2013 - 2017"
		},
		"2": {
			"institution": "Ege University",
			"field": "English Language and Literature",
			"period": "2017 - 2022"
		},
		"3": {
			"institution": "Academy Peak",
			"instructor": "Ömer Çıtak",
			"field": "Secure Software Development",
			"period": "16-18 March, 2023"
		}
	},
	"language": {
		"title": "Languages",
		"1": { "name": "English", "fluency": "Aptis C1" },
		"2": { "name": "Turkish", "fluency": "Native" }
	},
	"reference": {
		"title": "References",
		"1": {
			"name": "Alper Derya",
			"title": "Software Development Manager",
			"phone": "+90 533 210 80 28",
			"email": "alper.derya@gmail.com",
			"company": "Etstur"
		},
		"2": {
			"name": "Uğur Yılmaz",
			"title": "Front-end Team Lead",
			"phone": "+90 545 551 19 93",
			"email": "ugrr.yilmaz@gmail.com",
			"company": "Etstur"
		}
	}
}
