{
	"header": {
		"name": "Alper Aktaş",
		"title": "Yazılım Geliştirici",
		"phone": "+90 534 621 81 05",
		"mail": "aktasalper99@gmail.com",
		"linkedIn": "https://www.linkedin.com/in/aktasalper/",
		"portfolio": "https://www.aktasalper.com/",
		"location": "Avcılar, İstanbul"
	},
	"experience": {
		"title": "Deneyim",
		"summary": "3+ yıllık deneyime sahip frontend geliştirici. Ölçeklenebilir ve sürdürülebilir web uygulamaları sunma konusunda yetkin. TypeScript ve React konusunda güçlü bir temele sahip; modern UI desenleri, bileşen odaklı geliştirme ve duyarlı tasarımda uzman. Redux Toolkit, MUI ve Storybook gibi araçlar konusunda derin bilgi sahibi.",
		"present": "Günümüz",
		"companies": {
			"ets-2": {
				"company": "Etstur",
				"title": "Yazılım Geliştirici",
				"period": { "start": "Mayıs 2025", "end": "Ağustos 2025" },
				"description": "UI Kit projesinin yazılım geliştirme sürecine liderlik etti ve yan proje olarak bir Yapay Zeka Form Aracısı geliştirdi.",
				"role": {
					"1": {
						"project": "Form Agent",
						"description": "Yıllık performans değerlendirmesi için seçilen bir yan projeydi. Gemini ile basit bir POC geliştirildi."
					},
					"2": {
						"project": "UI Kit",
						"description": "Extranet, Intranet ve iki ek departman projesi için tekrar kullanılabilir React bileşenleri sağlayan B2B UI Kit kütüphanesinin geliştirilmesine liderlik etti."
					}
				}
			},
			"ets": {
				"company": "Etstur",
				"title": "Junior Yazılım Geliştirici",
				"period": { "start": "25 Temmuz 2022", "end": "Mayıs 2025" },
				"description": "Şirketin ilk React tabanlı B2B web uygulamalarının geliştirilmesine katıldı. UI/UX tasarımcılarıyla Figma üzerinden iş birliği yaptı ve Jira ile yürütülen çevik süreçlerde çeşitli projelere katkıda bulundu, bilgi paylaşımı için dökümantasyon oluşturdu.",
				"role": {
					"1": {
						"project": "UI Kit",
						"description": "UI Kit projesini kavramsallaştırdı ve inşa etti; Figma tasarımlarını React bileşen kütüphanesine dönüştürdü. Mevcut projelere bileşen bazlı import yapılabilmesini sağlayan bir CLI aracı geliştirdi ve projeyi Yarn workspaces kullanarak monorepo olarak yapılandırdı."
					},
					"2": {
						"project": "E-posta Şablonu",
						"description": "Mandrill ile entegre standart bir e-posta şablon sistemi oluşturdu, dağıtımları özel bir CLI betiği ile otomatikleştirdi. Başlangıçta 'mjml-react' kullanıldı, ardından sürdürülebilirlik ve kullanılabilirliği artırmak için 'react-email'e geçildi."
					},
					"3": {
						"project": "Extranet & Intranet",
						"description": "Modernizasyon sürecinin bir parçası olarak eski Extranet ve Intranet uygulamalarını güncelledi ve bakımını sağladı."
					},
					"4": {
						"project": "Dijital Sözleşme",
						"description": "Başından itibaren tek frontend geliştirici olarak Dijital Sözleşme projesine sahip çıktı; tatil otellerinin sözleşme detaylarını ve belgelerini yönetmelerini sağladı. Etstur’un Aylık Teknoloji Bülteni'nde 'Ayın Ürünü' seçildi ve yayından sonra yeni frontend ekibine destek sağladı."
					},
					"5": {
						"project": "B2B Şablon Projesi",
						"description": "Yeni projelerin kurulumunu hızlandırmak amacıyla teknoloji seçimi, kodlama standartları ve proje yapısını belirleyerek tekrar kullanılabilir bir B2B React şablon projesi geliştirdi."
					},
					"6": {
						"project": "etspartners.com",
						"description": "Etstur’un B2B paneli olan etspartners.com’un modernizasyonuna katkı sağladı; frontend’i React ile yeniden yazdı ve Java Spring Boot backend ile entegre etti. Dijital Sözleşme projesi dışındaki zamanlarda geliştirme, bakım ve hata ayıklama süreçlerine katıldı."
					}
				}
			},
			"1pixel": {
				"company": "1Pixel Dijital Ajansı",
				"title": "Frontend Geliştirme Stajyeri",
				"period": { "start": "Ekim 2021", "end": "Kasım 2021" },
				"description": "Jira ile yönetilen çevik süreçler dahilinde grafik tasarımlara dayalı, duyarlı ve işlevsel sayfa bölümleri uyguladı.",
				"role": {
					"1": {
						"project": "Shopify Şablonları",
						"description": "CMS kontrolleri olan özelleştirilebilir Shopify temaları geliştirdi ve Liquid şablonlama diliyle dinamik mağaza verilerini entegre etti."
					}
				}
			}
		}
	},
	"education": {
		"title": "Eğitim",
		"1": {
			"institution": "Ege Üniversitesi",
			"field": "İngiliz Dili ve Edebiyatı",
			"period": "2017 - 2022"
		},
		"2": {
			"institution": "Academy Peak",
			"instructor": "Ömer Çıtak",
			"field": "Güvenli Yazılım Geliştirme",
			"period": "16-18 Mart 2023"
		}
	},
	"language": {
		"title": "Diller",
		"1": { "name": "İngilizce", "fluency": "Aptis C1" },
		"2": { "name": "Türkçe", "fluency": "Ana Dil" }
	},
	"reference": {
		"title": "Referanslar",
		"1": {
			"name": "Alper Derya",
			"title": "Yazılım Geliştirme Müdürü",
			"phone": "+90 533 210 80 28",
			"email": "alper.derya@gmail.com",
			"company": "Etstur"
		},
		"2": {
			"name": "Uğur Yılmaz",
			"title": "Frontend Takım Lideri",
			"phone": "+90 545 551 19 93",
			"email": "ugrr.yilmaz@gmail.com",
			"company": "Etstur"
		}
	}
}
