{
	"header": {
		"name": "Alper Halil",
		"location": "Schongau, Bavyera, Almanya",
		"summary": "3+ yıllık deneyime sahip, ölçeklenebilir ve sürdürülebilir web uygulamaları geliştiren yazılım geliştirici. TypeScript, React ve modern UI desenlerinde yetkin, kod kalitesini artırma, iş akışlarını iyileştirme ve kullanıcı deneyimini geliştirme konusunda kanıtlanmış bir geçmişe sahip."
	},
	"experience": {
		"title": "Deneyim",
		"present": "Devam Ediyor",
		"skills": "Yetenekler",
		"companies": {
			"ets": {
				"company": "Etstur",
				"location": "İstanbul, Türkiye",
				"title": "Yazılım Geliştirici",
				"period": { "start": "Temmuz 2022", "end": "Ağustos 2025" },
				"description": "Agile ve çapraz fonksiyonlu bir ortamda React ile B2B web uygulamalarını modernleştirdim. Dijital Kontrat projesini tek başıma ön yüz geliştiricisi olarak yönettim, eski B2B uygulamaları modern React teknolojileriyle yeniden inşa ettim ve UI/UX ekip standartlarına dayalı yeni bir B2B UI bileşen kütüphanesinin geliştirilmesine liderlik ettim. Tutarlı UI uygulaması sağladım ve tasarımdan koda dönüşüm sürecini önemli ölçüde hızlandırdım. Ayrıca şirketin DevOps toplantılarında ön yüz temsilcisi olarak görev aldım.",
				"role": {
					"1": {
						"project": "UI Kit",
						"description": "Figma tasarımlarını yeniden kullanılabilir bir React bileşen kütüphanesine dönüştürdüm, bileşen entegrasyonunu kolaylaştıran bir CLI aracı geliştirdim ve Storybook ile dokümantasyonu organize ettim. Extranet, Intranet ve diğer departman projeleri için yeniden kullanılabilir React bileşenleri sağladım, yeni UI Kit'in B2B uygulamalarında tutarlı şekilde uygulanmasını sağladım ve tasarımdan koda verimliliği önemli ölçüde artırdım. Teknik rehberlik ve işbirlikçi atölyelerle ekipler arası benimsemeyi kolaylaştırdım."
					},
					"2": {
						"project": "E-mail Templates",
						"description": "Standart bir e-posta template sistemi geliştirdim, dağıtımları otomatikleştirdim ve tutarlılığı artırdım. Ürün ve tasarım ekipleriyle koordineli çalışarak şablonların marka ve kullanılabilirlik standartlarına uygun olmasını sağladım."
					},
					"3": {
						"project": "Extranet & Intranet",
						"description": "Eski Extranet ve Intranet uygulamalarını iyileştirdim, teknik borcu azalttım ve modernizasyon sürecine katkı sağladım. Eski Freemarker kodunda hataları düzelttim ve Java controller'larını yönettim. Ön yüzü React ile yeniden yazarak ve Java Spring Boot backend ile REST API üzerinden entegre ederek modernleştirilmiş versiyonlar oluşturdum, güvenilirlik ve sürdürülebilirliği önemli ölçüde artırdım."
					},
					"4": {
						"project": "Dijital Kontrat",
						"description": "Dijital Kontrat projesini tek frontend developer olarak ilerlettim, Etstur'un kontrat ekibinin kontrat verilerini dijitalleştirmesini ve şirket içinde birden fazla departman arasında akışını takip etmesini sağladım. Son kullanıcılara çözümler sunmak için işbirliği yaptım ve projenin şirket çapında takdir kazanmasında rol aldım."
					}
				}
			},
			"1pixel": {
				"company": "1Pixel Digital Agency",
				"location": "İzmir, Türkiye",
				"title": "Ön Yüz Geliştirme Stajyeri",
				"period": { "start": "Ekim 2021", "end": "Kasım 2021" },
				"description": "Agile ve Jira ile yönetilen bir iş akışında grafik tasarımlardan duyarlı ve yüksek kaliteli sayfa bölümleri geliştirdim.",
				"role": {
					"1": {
						"project": "Shopify Şablonları",
						"description": "Müşteri esnekliğini artırmak için CMS kontrolleriyle özelleştirilebilir Shopify temaları oluşturdum ve dinamik mağaza verilerini Liquid şablonlama ile entegre ettim."
					}
				}
			}
		}
	},
	"education": {
		"title": "Eğitim & Kurslar",
		"1": {
			"institution": "Ege Üniversitesi",
			"field": "İngiliz Dili ve Edebiyatı Lisans",
			"period": "2022"
		},
		"2": {
			"institution": "Academy Peak",
			"field": "Ömer Çıtak ile Güvenli Yazılım Geliştirme",
			"period": "16-18 Mart, 2023"
		}
	},
	"reference": {
		"title": "Referanslar",
		"1": {
			"name": "Alper Derya",
			"title": "Yazılım Geliştirme Müdürü",
			"phone": "+90 533 210 80 28",
			"email": "alper.derya@gmail.com",
			"company": "Etstur"
		},
		"2": {
			"name": "Uğur Yılmaz",
			"title": "Ön Yüz Takım Lideri",
			"phone": "+90 545 551 19 93",
			"email": "ugrr.yilmaz@gmail.com",
			"company": "Turkcell (Ex-Etstur)"
		}
	}
}
